ELF Header:
  Magic:   7f 45 4c 46 01 02 01 00 00 00 00 00 00 00 00 00 
  Class:                             ELF32
  Data:                              2's complement, big endian
  Version:                           1 (current)
  OS/ABI:                            UNIX - System V
  ABI Version:                       0
  Type:                              REL (Relocatable file)
  Machine:                           MC68000
  Version:                           0x1
  Entry point address:               0x0
  Start of program headers:          0 (bytes into file)
  Start of section headers:          11304 (bytes into file)
  Flags:                             0x0
  Size of this header:               52 (bytes)
  Size of program headers:           0 (bytes)
  Number of program headers:         0
  Size of section headers:           40 (bytes)
  Number of section headers:         21
  Section header string table index: 20

Section Headers:
  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al
  [ 0]                   NULL            00000000 000000 000000 00      0   0  0
  [ 1] .text             PROGBITS        00000000 000034 0006fe 00  AX  0   0  4
  [ 2] .rela.text        RELA            00000000 00204c 000180 0c   I 18   1  4
  [ 3] .data             PROGBITS        00000000 000734 000000 00  WA  0   0  4
  [ 4] .bss              NOBITS          00000000 000734 000001 00  WA  0   0  4

  0x00000760 015c027e 7c157600 03b20000 005b027e .\.~|.v......[.~
  0x00000770 7a000019 00000000 03b30000 060b0000 z...............
  0x00000780 00000000 003a019c 000007bc 14700003 .....:.......p..
  0x00000790 b3000001 5c029100 1b000000 00000000 ....\...........
  0x000007a0 32155f70 0003b400 00015c02 7e7c1576 2._p......\.~|.v
  0x000007b0 0003b400 00060b02 7e780000 13000000 ........~x......
  0x000007c0 00042300 00000000 00002201 9c000007 ..#.......".....
  0x000007d0 ec147000 04230000 02130291 00146172 ..p..#........ar
  0x000007e0 67000423 0000007d 02910400 1c000000 g..#...}........
  0x000007f0 00052100 00007600 00000000 00003e01 ..!...v.......>.
  0x00000800 9c000008 53146300 05210000 002c0291 ....S.c..!...,..
  0x00000810 001d7069 00040523 0000082f 1e690005 ..pi...#.../.i..
  0x00000820 23000000 761e7600 05230000 007d0015 #...v.v..#...}..
  0x00000830 76000523 00000811 027e7c1b 00000000 v..#.....~|.....
  0x00000840 0000000c 1f000000 00052900 00007606 ..........)...v.
  0x00000850 00000018 00000000 052d0000 00000000 .........-......
  0x00000860 006a019c 0000088c 14700005 2d000008 .j.......p..-...
  0x00000870 8c029100 1b000000 00000000 30156d62 ............0.mb
  0x00000880 00053000 00015c02 7e7c0000 04040000 ..0...\.~|......
  0x00000890 00621800 00000005 3b000000 00000000 .b......;.......
  0x000008a0 56019c00 0008c014 7000053b 0000088c V.......p..;....
  0x000008b0 02910015 7100053d 0000007d 027e7c00 ....q..=...}.~|.
  0x000008c0 20000000 00054b00 00000000 0000c001  .....K.........
  0x000008d0 9c000009 3a210000 0000054d 00000076 ....:!.....M...v
  0x000008e0 000008e6 06001b00 00000000 0000a215 ................
  0x000008f0 6900054f 00000076 027e7c22 00000000 i..O...v.~|"....
  0x00000900 0000005a 00000925 16000000 00055400 ...Z...%......T.
  0x00000910 00007d02 7e781561 72670005 55000000 ..}.~x.arg..U...
  0x00000920 7d027e74 00230000 00001f00 00000005 }.~t.#..........
  0x00000930 5e000000 76060000 00002400 00000016 ^...v.....$.....
  0x00000940 00000000 051f0000 003e0503 00000000 .........>......
  0x00000950 25000000 00053800 00088c05 03000000 %.....8.........
  0x00000960 00260000 0000074b 0000096c 04040000 .&.....K...l....
  0x00000970 007f2600 00000007 6d000000 37260000 ..&.....m...7&..
  0x00000980 00000774 0000093a 26000000 00042600 ...t...:&.....&.
  0x00000990 00099304 04000000 7d260000 00000426 ........}&.....&
  0x000009a0 00000993 0d000000 7d000009 af270026 ........}....'.&
  0x000009b0 00000000 04270000 09a400            .....'.....

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x9b7 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x138): GNU C11 5.4.0 -mcpu=68020 -g
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x217): putchar.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xc8): /Users/kent/Desktop/tfd/toll.src/smn/src.m68k/caos
    <19>   DW_AT_low_pc      : 0x0
    <1d>   DW_AT_high_pc     : 0x6fe
    <21>   DW_AT_stmt_list   : 0x0
 <1><25>: Abbrev Number: 2 (DW_TAG_base_type)
    <26>   DW_AT_byte_size   : 4
    <27>   DW_AT_encoding    : 7	(unsigned)
    <28>   DW_AT_name        : (indirect string, offset: 0x22e): long unsigned int
 <1><2c>: Abbrev Number: 3 (DW_TAG_typedef)
    <2d>   DW_AT_name        : (indirect string, offset: 0x299): u_int
    <31>   DW_AT_decl_file   : 6
    <32>   DW_AT_decl_line   : 33
    <33>   DW_AT_type        : <0x37>
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 4
    <39>   DW_AT_encoding    : 7	(unsigned)
    <3a>   DW_AT_name        : (indirect string, offset: 0x198): unsigned int
 <1><3e>: Abbrev Number: 3 (DW_TAG_typedef)
    <3f>   DW_AT_name        : (indirect string, offset: 0xb3): u_char
    <43>   DW_AT_decl_file   : 6
    <44>   DW_AT_decl_line   : 35
    <45>   DW_AT_type        : <0x49>
 <1><49>: Abbrev Number: 2 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 1
    <4b>   DW_AT_encoding    : 8	(unsigned char)
    <4c>   DW_AT_name        : (indirect string, offset: 0x167): unsigned char
 <1><50>: Abbrev Number: 3 (DW_TAG_typedef)
    <51>   DW_AT_name        : (indirect string, offset: 0x55): u_short
    <55>   DW_AT_decl_file   : 6
    <56>   DW_AT_decl_line   : 36
    <57>   DW_AT_type        : <0x5b>
 <1><5b>: Abbrev Number: 2 (DW_TAG_base_type)
    <5c>   DW_AT_byte_size   : 2
    <5d>   DW_AT_encoding    : 7	(unsigned)
    <5e>   DW_AT_name        : (indirect string, offset: 0x1d5): short unsigned int
 <1><62>: Abbrev Number: 2 (DW_TAG_base_type)
    <63>   DW_AT_byte_size   : 1
    <64>   DW_AT_encoding    : 6	(signed char)
    <65>   DW_AT_name        : (indirect string, offset: 0x1f1): char
 <1><69>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <6a>   DW_AT_byte_size   : 4
    <6b>   DW_AT_type        : <0x6f>
 <1><6f>: Abbrev Number: 5 (DW_TAG_subroutine_type)
    <70>   DW_AT_sibling     : <0x76>
 <2><74>: Abbrev Number: 6 (DW_TAG_unspecified_parameters)
 <2><75>: Abbrev Number: 0
 <1><76>: Abbrev Number: 7 (DW_TAG_base_type)
    <77>   DW_AT_byte_size   : 4
    <78>   DW_AT_encoding    : 5	(signed)
    <79>   DW_AT_name        : int
 <1><7d>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7e>   DW_AT_byte_size   : 4
 <1><7f>: Abbrev Number: 3 (DW_TAG_typedef)
    <80>   DW_AT_name        : (indirect string, offset: 0x88): PROC
    <84>   DW_AT_decl_file   : 6
    <85>   DW_AT_decl_line   : 45
    <86>   DW_AT_type        : <0x8a>
 <1><8a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <8b>   DW_AT_name        : (indirect string, offset: 0x18e): proc
    <8f>   DW_AT_byte_size   : 16
    <90>   DW_AT_decl_file   : 4
    <91>   DW_AT_decl_line   : 28
    <92>   DW_AT_sibling     : <0xc6>
 <2><96>: Abbrev Number: 10 (DW_TAG_member)
    <97>   DW_AT_name        : fn
    <9a>   DW_AT_decl_file   : 4
    <9b>   DW_AT_decl_line   : 29
    <9c>   DW_AT_type        : <0x69>
    <a0>   DW_AT_data_member_location: 0
 <2><a1>: Abbrev Number: 11 (DW_TAG_member)
    <a2>   DW_AT_name        : (indirect string, offset: 0x12c): frame
    <a6>   DW_AT_decl_file   : 4
    <a7>   DW_AT_decl_line   : 30
    <a8>   DW_AT_type        : <0x7d>
    <ac>   DW_AT_data_member_location: 4
 <2><ad>: Abbrev Number: 11 (DW_TAG_member)
    <ae>   DW_AT_name        : (indirect string, offset: 0x2c6): desc
    <b2>   DW_AT_decl_file   : 4
    <b3>   DW_AT_decl_line   : 31
    <b4>   DW_AT_type        : <0x17a>
    <b8>   DW_AT_data_member_location: 8
 <2><b9>: Abbrev Number: 11 (DW_TAG_member)
    <ba>   DW_AT_name        : (indirect string, offset: 0x7e): unit
    <be>   DW_AT_decl_file   : 4
    <bf>   DW_AT_decl_line   : 31
    <c0>   DW_AT_type        : <0x17a>
    <c4>   DW_AT_data_member_location: 12
 <2><c5>: Abbrev Number: 0
 <1><c6>: Abbrev Number: 3 (DW_TAG_typedef)
    <c7>   DW_AT_name        : (indirect string, offset: 0x2bc): MBUF
    <cb>   DW_AT_decl_file   : 3
    <cc>   DW_AT_decl_line   : 41
    <cd>   DW_AT_type        : <0xd1>
 <1><d1>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d2>   DW_AT_name        : (indirect string, offset: 0x6d): mbuf
    <d6>   DW_AT_byte_size   : 768
    <d8>   DW_AT_decl_file   : 3
    <d9>   DW_AT_decl_line   : 52
    <da>   DW_AT_sibling     : <0xf5>
 <2><de>: Abbrev Number: 10 (DW_TAG_member)
    <df>   DW_AT_name        : h
    <e1>   DW_AT_decl_file   : 3
    <e2>   DW_AT_decl_line   : 53
    <e3>   DW_AT_type        : <0xf5>
    <e7>   DW_AT_data_member_location: 0
 <2><e8>: Abbrev Number: 11 (DW_TAG_member)
    <e9>   DW_AT_name        : (indirect string, offset: 0x221): data
    <ed>   DW_AT_decl_file   : 3
    <ee>   DW_AT_decl_line   : 54
    <ef>   DW_AT_type        : <0x162>
    <f3>   DW_AT_data_member_location: 16
 <2><f4>: Abbrev Number: 0
 <1><f5>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f6>   DW_AT_name        : (indirect string, offset: 0x6): mbuf_hdr
    <fa>   DW_AT_byte_size   : 16
    <fb>   DW_AT_decl_file   : 3
    <fc>   DW_AT_decl_line   : 46
    <fd>   DW_AT_sibling     : <0x155>
 <2><101>: Abbrev Number: 11 (DW_TAG_member)
    <102>   DW_AT_name        : (indirect string, offset: 0x162): tail
    <106>   DW_AT_decl_file   : 3
    <107>   DW_AT_decl_line   : 47
    <108>   DW_AT_type        : <0x155>
    <10c>   DW_AT_data_member_location: 0
 <2><10d>: Abbrev Number: 11 (DW_TAG_member)
    <10e>   DW_AT_name        : (indirect string, offset: 0x79): head
    <112>   DW_AT_decl_file   : 3
    <113>   DW_AT_decl_line   : 47
    <114>   DW_AT_type        : <0x155>
    <118>   DW_AT_data_member_location: 2
 <2><119>: Abbrev Number: 10 (DW_TAG_member)
    <11a>   DW_AT_name        : rw
    <11d>   DW_AT_decl_file   : 3
    <11e>   DW_AT_decl_line   : 47
    <11f>   DW_AT_type        : <0x155>
    <123>   DW_AT_data_member_location: 4
 <2><124>: Abbrev Number: 11 (DW_TAG_member)
    <125>   DW_AT_name        : (indirect string, offset: 0x193): type
    <129>   DW_AT_decl_file   : 3
    <12a>   DW_AT_decl_line   : 48
    <12b>   DW_AT_type        : <0x3e>
    <12f>   DW_AT_data_member_location: 6
 <2><130>: Abbrev Number: 11 (DW_TAG_member)
    <131>   DW_AT_name        : (indirect string, offset: 0x132): links
    <135>   DW_AT_decl_file   : 3
    <136>   DW_AT_decl_line   : 48
    <137>   DW_AT_type        : <0x3e>
    <13b>   DW_AT_data_member_location: 7
 <2><13c>: Abbrev Number: 11 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0x2c1): next
    <141>   DW_AT_decl_file   : 3
    <142>   DW_AT_decl_line   : 49
    <143>   DW_AT_type        : <0x15c>
    <147>   DW_AT_data_member_location: 8
 <2><148>: Abbrev Number: 11 (DW_TAG_member)
    <149>   DW_AT_name        : (indirect string, offset: 0x155): queue
    <14d>   DW_AT_decl_file   : 3
    <14e>   DW_AT_decl_line   : 49
    <14f>   DW_AT_type        : <0x15c>
    <153>   DW_AT_data_member_location: 12
 <2><154>: Abbrev Number: 0
 <1><155>: Abbrev Number: 2 (DW_TAG_base_type)
    <156>   DW_AT_byte_size   : 2
    <157>   DW_AT_encoding    : 5	(signed)
    <158>   DW_AT_name        : (indirect string, offset: 0x23): short int
 <1><15c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <15d>   DW_AT_byte_size   : 4
    <15e>   DW_AT_type        : <0xc6>
 <1><162>: Abbrev Number: 13 (DW_TAG_array_type)
    <163>   DW_AT_type        : <0x49>
    <167>   DW_AT_sibling     : <0x173>
 <2><16b>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <16c>   DW_AT_type        : <0x173>
    <170>   DW_AT_upper_bound : 751
 <2><172>: Abbrev Number: 0
 <1><173>: Abbrev Number: 2 (DW_TAG_base_type)
    <174>   DW_AT_byte_size   : 4
    <175>   DW_AT_encoding    : 7	(unsigned)
    <176>   DW_AT_name        : (indirect string, offset: 0x2d): sizetype
 <1><17a>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <17b>   DW_AT_byte_size   : 4
    <17c>   DW_AT_type        : <0x180>
 <1><180>: Abbrev Number: 15 (DW_TAG_const_type)
    <181>   DW_AT_type        : <0x62>
 <1><185>: Abbrev Number: 16 (DW_TAG_subprogram)
    <186>   DW_AT_name        : chk
    <18a>   DW_AT_decl_file   : 1
    <18b>   DW_AT_decl_line   : 31
    <18c>   DW_AT_prototyped  : 1
    <18c>   DW_AT_low_pc      : 0x0
    <190>   DW_AT_high_pc     : 0x22
    <194>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <196>   DW_AT_GNU_all_call_sites: 1
    <196>   DW_AT_sibling     : <0x1b7>
 <2><19a>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <19b>   DW_AT_name        : (indirect string, offset: 0x221): data
    <19f>   DW_AT_decl_file   : 1
    <1a0>   DW_AT_decl_line   : 31
    <1a1>   DW_AT_type        : <0x50>
    <1a5>   DW_AT_location    : 2 byte block: 7e 7e 	(DW_OP_breg14 (r14): -2)
 <2><1a8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <1a9>   DW_AT_name        : (indirect string, offset: 0x0): limit
    <1ad>   DW_AT_decl_file   : 1
    <1ae>   DW_AT_decl_line   : 31
    <1af>   DW_AT_type        : <0x50>
    <1b3>   DW_AT_location    : 2 byte block: 7e 7c 	(DW_OP_breg14 (r14): -4)
 <2><1b6>: Abbrev Number: 0
 <1><1b7>: Abbrev Number: 18 (DW_TAG_subprogram)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x188): abort
    <1bc>   DW_AT_decl_file   : 7
    <1bd>   DW_AT_decl_line   : 66
    <1be>   DW_AT_prototyped  : 1
    <1be>   DW_AT_noreturn    : 1
    <1be>   DW_AT_low_pc      : 0x22
    <1c2>   DW_AT_high_pc     : 0xc
    <1c6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1c8>   DW_AT_GNU_all_tail_call_sites: 1
 <1><1c8>: Abbrev Number: 19 (DW_TAG_subprogram)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x155): queue
    <1cd>   DW_AT_decl_file   : 2
    <1ce>   DW_AT_decl_line   : 86
    <1cf>   DW_AT_prototyped  : 1
    <1cf>   DW_AT_low_pc      : 0x2e
    <1d3>   DW_AT_high_pc     : 0x36
    <1d7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1d9>   DW_AT_GNU_all_tail_call_sites: 1
    <1d9>   DW_AT_sibling     : <0x213>
 <2><1dd>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <1de>   DW_AT_name        : (indirect string, offset: 0x18e): proc
    <1e2>   DW_AT_decl_file   : 2
    <1e3>   DW_AT_decl_line   : 86
    <1e4>   DW_AT_type        : <0x213>
    <1e8>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><1eb>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1ec>   DW_AT_name        : arg
    <1f0>   DW_AT_decl_file   : 2
    <1f1>   DW_AT_decl_line   : 86
    <1f2>   DW_AT_type        : <0x7d>
    <1f6>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><1f9>: Abbrev Number: 21 (DW_TAG_variable)
    <1fa>   DW_AT_name        : _p
    <1fd>   DW_AT_decl_file   : 2
    <1fe>   DW_AT_decl_line   : 88
    <1ff>   DW_AT_type        : <0x21e>
    <203>   DW_AT_location    : 1 byte block: 50 	(DW_OP_reg0 (r0))
 <2><205>: Abbrev Number: 22 (DW_TAG_variable)
    <206>   DW_AT_name        : (indirect string, offset: 0x2a7): _arg
